netify-soap/src/test/resources/soap/requests/genre/GetGenreCountRequestTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://duo.nl/namespace/netify/general">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:GetGenreCountRequest/>
    </soapenv:Body>
</soapenv:Envelope>